SpenceKonde/ATTinyCore/boards.txt
attinyx8.name=ATtiny48/88
attinyx8.upload.tool=avrdude
attinyx8.build.board=AVR_ATTINYX8
attinyx8.bootloader.tool=avrdude
attinyx8.bootloader.unlock_bits=0xFF
attinyx8.bootloader.lock_bits=0xFF
attinyx8.build.core=tiny
attinyx8.build.export_merged_output=false
attinyx8.menu.LTO.enable=Enabled
attinyx8.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8.menu.LTO.enable.ltocppflags=-flto
attinyx8.menu.LTO.enable.ltoarcmd=gcc-
attinyx8.menu.LTO.disable=Disabled
attinyx8.menu.LTO.disable.ltocflags=
attinyx8.menu.LTO.disable.ltoelfflags=
attinyx8.menu.LTO.disable.ltocppflags=
attinyx8.menu.LTO.disable.ltoarcmd=
attinyx8.menu.chip.88=ATtiny88
attinyx8.menu.chip.88.build.mcu=attiny88
attinyx8.menu.chip.88.upload.maximum_size=8192
attinyx8.menu.chip.88.upload.maximum_data_size=512
attinyx8.menu.chip.48=ATtiny48
attinyx8.menu.chip.48.build.mcu=attiny48
attinyx8.menu.chip.48.upload.maximum_size=4096
attinyx8.menu.chip.48.upload.maximum_data_size=256
attinyx8.bootloader.extended_fuses=0xff
attinyx8.bootloader.file=empty/empty_all.hex
attinyx8.menu.clock.8internal=8 MHz (internal)
attinyx8.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8.menu.clock.8internal.build.f_cpu=8000000L
attinyx8.menu.clock.8internal.build.clocksource=0
attinyx8.menu.clock.1internal=1 MHz (internal)
attinyx8.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.1internal.build.f_cpu=1000000L
attinyx8.menu.clock.1internal.build.clocksource=0
attinyx8.menu.clock.4internal=4 MHz (internal)
attinyx8.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx8.menu.clock.4internal.build.f_cpu=4000000L
attinyx8.menu.clock.4internal.build.clocksource=0
attinyx8.menu.clock.128internal=128 kHz (internal WDT)
attinyx8.menu.clock.128internal.bootloader.low_fuses=0xC3
attinyx8.menu.clock.128internal.build.f_cpu=128000L
attinyx8.menu.clock.128external.build.clocksource=3
attinyx8.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.8external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.8external.build.f_cpu=8000000L
attinyx8.menu.clock.8external.build.clocksource=2
attinyx8.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attinyx8.menu.clock.12external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.12external.build.f_cpu=12000000L
attinyx8.menu.clock.12external.build.clocksource=2
attinyx8.menu.clock.16external=16 MHz (external CLOCK, overclocked - Danger: see docs!)
attinyx8.menu.clock.16external.bootloader.low_fuses=0xE0
attinyx8.menu.clock.16external.build.f_cpu=16000000L
attinyx8.menu.clock.16external.build.clocksource=2
attinyx8.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8.menu.eesave.aenable=EEPROM retained
attinyx8.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx8.menu.eesave.disable=EEPROM not retained
attinyx8.menu.eesave.disable.bootloader.eesave_bit=1
attinyx8.menu.bod.disable=B.O.D. Disabled
attinyx8.menu.bod.disable.bootloader.bod_bits=111
attinyx8.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8.menu.bod.1v8.bootloader.bod_bits=110
attinyx8.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8.menu.bod.2v7.bootloader.bod_bits=101
attinyx8.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8.menu.bod.4v3.bootloader.bod_bits=100
attinyx8.build.variant=tinyX8
attinyx8.menu.millis.enabled=Enabled
attinyx8.menu.millis.disabled=Disabled (saves flash)
attinyx8.menu.millis.enabled.build.millis=
attinyx8.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8.build.extra_flags={build.millis} {build.neopixelport}


attinyx8opti.name=ATtiny48/88 (optiboot)
attinyx8opti.upload.tool=avrdude
attinyx8opti.upload.protocol=arduino
attinyx8opti.upload.speed=19200
attinyx8opti.bootloader.file=optiboot/optiboot_{build.mcu}_{build.f_cpu}.hex
attinyx8opti.build.board=AVR_ATTINYX8
attinyx8opti.bootloader.tool=avrdude
attinyx8opti.bootloader.unlock_bits=0xFF
attinyx8opti.bootloader.lock_bits=0xFF
attinyx8opti.build.core=tiny
attinyx8opti.build.export_merged_output=false
attinyx8opti.menu.LTO.enable=Enabled
attinyx8opti.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx8opti.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx8opti.menu.LTO.enable.ltocppflags=-flto
attinyx8opti.menu.LTO.enable.ltoarcmd=gcc-
attinyx8opti.menu.LTO.disable=Disabled
attinyx8opti.menu.LTO.disable.ltocflags=
attinyx8opti.menu.LTO.disable.ltoelfflags=
attinyx8opti.menu.LTO.disable.ltocppflags=
attinyx8opti.menu.LTO.disable.ltoarcmd=
attinyx8opti.menu.chip.88=ATtiny88
attinyx8opti.menu.chip.88.build.mcu=attiny88
attinyx8opti.menu.chip.88.upload.maximum_size=7552
attinyx8opti.menu.chip.88.upload.maximum_data_size=512
attinyx8opti.menu.chip.48=ATtiny48
attinyx8opti.menu.chip.48.build.mcu=attiny48
attinyx8opti.menu.chip.48.upload.maximum_size=3456
attinyx8opti.menu.chip.48.upload.maximum_data_size=256
attinyx8opti.bootloader.extended_fuses=0xfe
attinyx8opti.menu.clock.8internal=8 MHz (internal)
attinyx8opti.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx8opti.menu.clock.8internal.build.f_cpu=8000000L
attinyx8opti.menu.clock.8internal.build.clocksource=0
attinyx8opti.menu.clock.4internal=4 MHz (internal)
attinyx8opti.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.4internal.build.f_cpu=4000000L
attinyx8opti.menu.clock.4internal.build.clocksource=0
attinyx8opti.menu.clock.1internal=1 MHz (internal)
attinyx8opti.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx8opti.menu.clock.1internal.build.f_cpu=1000000L
attinyx8opti.menu.clock.1internal.build.clocksource=0
attinyx8opti.menu.clock.8external=8 MHz (external CLOCK - Danger: see docs!)
attinyx8opti.menu.clock.8external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.8external.build.f_cpu=8000000L
attinyx8opti.menu.clock.8external.build.clocksource=2
attinyx8opti.menu.clock.12external=12 MHz (external CLOCK - Danger: see docs!)
attinyx8opti.menu.clock.12external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.12external.build.f_cpu=12000000L
attinyx8opti.menu.clock.16external.build.clocksource=2
attinyx8opti.menu.clock.16external=16 MHz (external CLOCK, overclocked - Danger: see docs!)
attinyx8opti.menu.clock.16external.bootloader.low_fuses=0xE0
attinyx8opti.menu.clock.16external.build.f_cpu=16000000L
attinyx8opti.menu.clock.16external.build.clocksource=2
attinyx8opti.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx8opti.menu.eesave.aenable=EEPROM retained
attinyx8opti.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx8opti.menu.eesave.disable=EEPROM not retained
attinyx8opti.menu.eesave.disable.bootloader.eesave_bit=1
attinyx8opti.menu.bod.disable=B.O.D. Disabled
attinyx8opti.menu.bod.disable.bootloader.bod_bits=111
attinyx8opti.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx8opti.menu.bod.1v8.bootloader.bod_bits=110
attinyx8opti.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx8opti.menu.bod.2v7.bootloader.bod_bits=101
attinyx8opti.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx8opti.menu.bod.4v3.bootloader.bod_bits=100
attinyx8opti.build.variant=tinyX8
attinyx8opti.menu.millis.enabled=Enabled
attinyx8opti.menu.millis.disabled=Disabled (saves flash)
attinyx8opti.menu.millis.enabled.build.millis=
attinyx8opti.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx8opti.menu.neopixelport.porta=Port A (pins 23~26)
attinyx8opti.menu.neopixelport.portb=Port B (pins 16~22,27)
attinyx8opti.menu.neopixelport.portc=Port C (pins 9~13)
attinyx8opti.menu.neopixelport.portd=Port D (pins 0~7)
attinyx8opti.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx8opti.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx8opti.menu.neopixelport.portc.build.neopixelport=-DNEOPIXELPORT=PORTC
attinyx8opti.menu.neopixelport.portd.build.neopixelport=-DNEOPIXELPORT=PORTD
attinyx8opti.build.extra_flags={build.millis} {build.neopixelport}

attinyx7.name=ATtiny87/167 (No bootloader)
attinyx7.upload.maximum_data_size=512
attinyx7.upload.tool=avrdude
attinyx7.build.board=AVR_ATTINYX7
attinyx7.bootloader.tool=avrdude
attinyx7.bootloader.unlock_bits=0xFF
attinyx7.bootloader.lock_bits=0xFF
attinyx7.bootloader.file=empty/empty_all.hex
attinyx7.build.core=tiny
attinyx7.build.export_merged_output=false
attinyx7.bootloader.extended_fuses=0xFF
attinyx7.menu.LTO.enable=Enabled
attinyx7.menu.LTO.enable.ltocflags=-flto -fno-fat-lto-objects
attinyx7.menu.LTO.enable.ltoelfflags=-g -flto -fuse-linker-plugin
attinyx7.menu.LTO.enable.ltocppflags=-flto
attinyx7.menu.LTO.enable.ltoarcmd=gcc-
attinyx7.menu.LTO.disable=Disabled
attinyx7.menu.LTO.disable.ltocflags=
attinyx7.menu.LTO.disable.ltoelfflags=
attinyx7.menu.LTO.disable.ltocppflags=
attinyx7.menu.LTO.disable.ltoarcmd=
attinyx7.menu.chip.167=ATtiny167
attinyx7.menu.chip.167.build.mcu=attiny167
attinyx7.menu.chip.167.upload.maximum_size=16384
attinyx7.menu.chip.87=ATtiny87
attinyx7.menu.chip.87.build.mcu=attiny87
attinyx7.menu.chip.87.upload.maximum_size=8196
attinyx7.upload.maximum_data_size=512
attinyx7.menu.clock.8internal=8 MHz (internal)
attinyx7.menu.clock.8internal.bootloader.low_fuses=0xE2
attinyx7.menu.clock.8internal.build.f_cpu=8000000L
attinyx7.menu.clock.8internal.build.clocksource=0
attinyx7.menu.clock.20external=20 MHz (external)
attinyx7.menu.clock.20external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.20external.build.f_cpu=20000000L
attinyx7.menu.clock.20external.build.clocksource=1
attinyx7.menu.clock.16external=16 MHz (external)
attinyx7.menu.clock.16external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.16external.build.f_cpu=16000000L
attinyx7.menu.clock.16external.build.clocksource=1
attinyx7.menu.clock.12external=12 MHz (external)
attinyx7.menu.clock.12external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.12external.build.f_cpu=12000000L
attinyx7.menu.clock.12external.build.clocksource=1
attinyx7.menu.clock.8external=8 MHz (external)
attinyx7.menu.clock.8external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.8external.build.f_cpu=8000000L
attinyx7.menu.clock.8external.build.clocksource=1
attinyx7.menu.clock.6external=6 MHz (external)
attinyx7.menu.clock.6external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.6external.build.f_cpu=6000000L
attinyx7.menu.clock.6external.build.clocksource=1
attinyx7.menu.clock.4external=4 MHz (external)
attinyx7.menu.clock.4external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.4external.build.f_cpu=4000000L
attinyx7.menu.clock.4external.build.clocksource=1
attinyx7.menu.clock.1internal=1 MHz (internal)
attinyx7.menu.clock.1internal.bootloader.low_fuses=0x62
attinyx7.menu.clock.1internal.build.f_cpu=1000000L
attinyx7.menu.clock.1internal.build.clocksource=0
attinyx7.menu.clock.737external=7.372 MHz (external)
attinyx7.menu.clock.737external.bootloader.low_fuses=0xFD
attinyx7.menu.clock.737external.build.f_cpu=7372800L
attinyx7.menu.clock.737external.build.clocksource=1
attinyx7.menu.clock.92external=9.216 MHz (external)
attinyx7.menu.clock.92external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.92external.build.f_cpu=9216000L
attinyx7.menu.clock.92external.build.clocksource=1
attinyx7.menu.clock.11external=11.0592 MHz (external)
attinyx7.menu.clock.11external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.11external.build.f_cpu=11059200L
attinyx7.menu.clock.11external.build.clocksource=1
attinyx7.menu.clock.14external=14.7456 MHz (external)
attinyx7.menu.clock.14external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.14external.build.f_cpu=14745600L
attinyx7.menu.clock.14external.build.clocksource=1
attinyx7.menu.clock.184external=18.432 MHz (external)
attinyx7.menu.clock.184external.bootloader.low_fuses=0xFF
attinyx7.menu.clock.184external.build.f_cpu=18432000L
attinyx7.menu.clock.184external.build.clocksource=1
attinyx7.menu.clock.4internal=4 MHz (internal)
attinyx7.menu.clock.4internal.bootloader.low_fuses=0x62
attinyx7.menu.clock.4internal.build.f_cpu=4000000L
attinyx7.menu.clock.4internal.build.clocksource=0
attinyx7.menu.clock.128internal=128 kHz (internal WDT)
attinyx7.menu.clock.128internal.bootloader.low_fuses=0xC3
attinyx7.menu.clock.128internal.build.f_cpu=128000L
attinyx7.menu.clock.128internal.build.clocksource=3
attinyx7.bootloader.high_fuses=0b1101{bootloader.eesave_bit}{bootloader.bod_bits}
attinyx7.menu.eesave.aenable=EEPROM retained
attinyx7.menu.eesave.aenable.bootloader.eesave_bit=0
attinyx7.menu.eesave.disable=EEPROM not retained
attinyx7.menu.eesave.disable.bootloader.eesave_bit=1
attinyx7.menu.bod.disable=B.O.D. Disabled
attinyx7.menu.bod.disable.bootloader.bod_bits=111
attinyx7.menu.bod.1v8=B.O.D. Enabled (1.8v)
attinyx7.menu.bod.1v8.bootloader.bod_bits=110
attinyx7.menu.bod.2v7=B.O.D. Enabled (2.7v)
attinyx7.menu.bod.2v7.bootloader.bod_bits=101
attinyx7.menu.bod.4v3=B.O.D. Enabled (4.3v)
attinyx7.menu.bod.4v3.bootloader.bod_bits=100
attinyx7.menu.pinmapping.new=New style (down each side)
attinyx7.menu.pinmapping.new.build.variant=tinyX7_New
attinyx7.menu.pinmapping.old=Old style (SCL on 13)
attinyx7.menu.pinmapping.old.build.variant=tinyX7
attinyx7.menu.millis.enabled=Enabled
attinyx7.menu.millis.disabled=Disabled (saves flash)
attinyx7.menu.millis.enabled.build.millis=
attinyx7.menu.millis.disabled.build.millis=-DDISABLEMILLIS
attinyx7.menu.neopixelport.porta=Port A (pins 0~7)
attinyx7.menu.neopixelport.portb=Port B (pins 8~15)
attinyx7.menu.neopixelport.porta.build.neopixelport=-DNEOPIXELPORT=PORTA
attinyx7.menu.neopixelport.portb.build.neopixelport=-DNEOPIXELPORT=PORTB
attinyx7.build.extra_flags={build.millis} {build.neopixelport}


